tap "1password/tap"
tap "elastic/tap"
tap "eth-p/software"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/core"
tap "microsoft/git"
tap "minio/stable"
tap "oven-sh/bun"
tap "puma/puma"
tap "unused-code/formulae"
tap "wez/wezterm"
tap "wickenico/wailbrew"
brew "ack"
brew "act"
brew "openssl@3", link: false
brew "libyaml"
brew "tree"
brew "ansible"
brew "zstd"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "protobuf"
brew "apache-arrow"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "gettext"
brew "libgit2"
brew "bat"
brew "bison"
brew "boost"
brew "btop"
brew "caddy"
brew "certbot"
brew "cgal"
brew "harfbuzz"
brew "libavif"
brew "pango"
brew "librsvg"
brew "chafa"
brew "check"
brew "clamav"
brew "cmake"
brew "gnupg"
brew "poppler"
brew "diff-pdf"
brew "dive"
brew "docker"
brew "docker-compose"
brew "doxygen"
brew "emscripten"
brew "libexif"
brew "exif"
brew "eza"
brew "fastfetch"
brew "fd"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "fish"
brew "freetds"
brew "fzf"
brew "pkgconf"
brew "hdf5"
brew "proj"
brew "shared-mime-info"
brew "libheif"
brew "libpq"
brew "libxml2"
brew "libspatialite"
brew "netcdf"
brew "openblas"
brew "numpy"
brew "sfcgal"
brew "gdal"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-crypt"
brew "gitlab-runner"
brew "gitu"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "graphviz"
brew "hivemind"
brew "htop"
brew "imagemagick"
brew "imagemagick@6"
brew "ipcalc"
brew "jpegoptim"
brew "jq"
brew "jump"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "libffi"
brew "libxmlsec1"
brew "llvm@19"
brew "lua-language-server"
brew "luarocks"
brew "marksman"
brew "memcached"
brew "mercurial"
brew "mise"
brew "mkcert"
brew "monit"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nushell"
brew "openjdk@11"
brew "opensearch"
brew "opentofu"
brew "openvpn"
brew "optipng"
brew "tmux", link: false
brew "overmind"
brew "pandoc"
brew "pinentry-mac"
brew "pipenv"
brew "pngquant"
brew "postgresql@18", restart_service: :changed
brew "potrace"
brew "pyenv"
brew "python@3.10"
brew "qt"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruff"
brew "rust"
brew "siege"
brew "sonar-scanner"
brew "sops"
brew "starship"
brew "telnet"
brew "tfenv"
brew "universal-ctags"
brew "uv"
brew "v8"
brew "vim"
brew "vips"
brew "watch"
brew "watchexec"
brew "wget"
brew "wxwidgets"
brew "yarn"
brew "zola"
brew "heroku/brew/heroku"
brew "minio/stable/minio"
brew "oven-sh/bun/bun"
brew "puma/puma/puma-dev"
brew "unused-code/formulae/unused"
cask "1password-cli"
cask "basictex"
cask "chromedriver"
cask "git-credential-manager"
cask "git-credential-manager"
cask "inkscape"
cask "macsvg"
cask "ngrok"
cask "polypane"
cask "tofu"
cask "wailbrew"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "docker.docker"
vscode "koichisasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "mvllow.rose-pine"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "vayan.haml"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "zainchen.json"
go "github.com/KarnerTh/mermerd"
